docs: docs redesign with mk docs
